Added: Multi listener capability
